package com.meng.oneQuestionPerDay.leetcode.editor.cn;

import java.util.*;
class NextBeautifulNumber2048 {
    static Map<Integer, List<Integer>> cache = new HashMap<>();
    static {
        cache.put(1, Collections.singletonList(1));
        cache.put(2,Collections.singletonList(22));
        cache.put(3, Arrays.asList(122,212,221,333));
        cache.put(4,Arrays.asList(1333,3133,3313,3331,4444));
        cache.put(5,Arrays.asList(14444,22333,23233,23323,23332,32233,32323,32332,33223,33232,33322,41444,44144,44414,44441,55555));
        cache.put(6,Arrays.asList(122333, 123233, 123323, 123332, 132233, 132323, 132332, 133223, 133232, 133322, 155555, 212333, 213233, 213323, 213332, 221333, 223133, 223313, 223331, 224444, 231233, 231323, 231332, 232133, 232313, 232331, 233123, 233132, 233213, 233231, 233312, 233321, 242444, 244244, 244424, 244442, 312233, 312323, 312332, 313223, 313232, 313322, 321233, 321323, 321332, 322133, 322313, 322331, 323123, 323132, 323213, 323231, 323312, 323321, 331223, 331232, 331322, 332123, 332132, 332213, 332231, 332312, 332321, 333122, 333212, 333221, 422444, 424244, 424424, 424442, 442244, 442424, 442442, 444224, 444242, 444422, 515555, 551555, 555155, 555515, 555551, 666666));
        cache.put(7,Collections.singletonList(1224444));
    }

    /**
     * 解答成功:
     * 	执行耗时:1 ms,击败了80.49% 的Java用户
     * 	内存消耗:38.4 MB,击败了82.93% 的Java用户
     * @param n
     * @return
     */
    public int nextBeautifulNumberMy(int n) {
        int len = String.valueOf(n).length();
        for(int i : cache.get(len)){
            if (i > n){
                return i;
            }
        }
        for(int i : cache.get(len+1)){
            if (i > n){
                return i;
            }
        }
        return -1;
    }

    /**
     *解答成功:
     * 	执行耗时:95 ms,击败了64.63% 的Java用户
     * 	内存消耗:42.6 MB,击败了6.10% 的Java用户
     * @param n
     * @return
     */
    public int nextBeautifulNumber1(int n) {
        for (int i = n + 1; i <= 1224444; ++i) {
            if (isBalance(i)) {
                return i;
            }
        }
        return -1;
    }

    private boolean isBalance(int x) {
        int[] count = new int[10];
        while (x > 0) {
            count[x % 10]++;
            x /= 10;
        }
        for (int d = 0; d < 10; ++d) {
            if (count[d] > 0 && count[d] != d) {
                return false;
            }
        }
        return true;
    }

    private static final int[] balance = new int[] {
            1, 22, 122, 212, 221, 333, 1333, 3133, 3313, 3331, 4444,
            14444, 22333, 23233, 23323, 23332, 32233, 32323, 32332,
            33223, 33232, 33322, 41444, 44144, 44414, 44441, 55555,
            122333, 123233, 123323, 123332, 132233, 132323, 132332,
            133223, 133232, 133322, 155555, 212333, 213233, 213323,
            213332, 221333, 223133, 223313, 223331, 224444, 231233,
            231323, 231332, 232133, 232313, 232331, 233123, 233132,
            233213, 233231, 233312, 233321, 242444, 244244, 244424,
            244442, 312233, 312323, 312332, 313223, 313232, 313322,
            321233, 321323, 321332, 322133, 322313, 322331, 323123,
            323132, 323213, 323231, 323312, 323321, 331223, 331232,
            331322, 332123, 332132, 332213, 332231, 332312, 332321,
            333122, 333212, 333221, 422444, 424244, 424424, 424442,
            442244, 442424, 442442, 444224, 444242, 444422, 515555,
            551555, 555155, 555515, 555551, 666666, 1224444
    };

    /**
     * 解答成功:
     * 	执行耗时:0 ms,击败了100.00% 的Java用户
     * 	内存消耗:38.4 MB,击败了82.93% 的Java用户
     * @param n
     * @return
     */
    public int nextBeautifulNumber(int n) {
        int i = Arrays.binarySearch(balance, n + 1);
        if (i < 0) {
            i = -i - 1;
        }
        return balance[i];
    }

}

